app/controllers/guests_controller.rb

SELECT `guests`.* FROM `guests`
---
  def index
    if Guest.all.length >= 300

SELECT `guests`.* FROM `guests`
SELECT  `guests`.* FROM `guests`  WHERE `guests`.`email` = 'as@mit.edu'  ORDER BY `guests`.`id` ASC LIMIT 1
INSERT INTO `guests` (`created_at`, `email`, `first_name`, `last_name`, `student`, `updated_at`, `zip`) VALUES ('2014-11-08 03:35:48', 'bschreck@mit.edu', 'Ben', 'Schreck', 1, '2014-11-08 03:35:48', 2215)
---
  def rsvp
    student = rsvp_params[:student]
    email = rsvp_params[:email]
    if Guest.all.length >= 300
      redirect_to action: :over
    else
      if email and student
        exists = Guest.where(email: email).first
        if exists
          flash.alert = "Email exists"
          redirect_to action: :index, guest: @new_guest
        else
          @new_guest = Guest.new(student: student, email: email)
          if @new_guest.save